Configuration/Documents/Реализация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Реализация</Name>
			<BasedOn>
				<xr:Item>Document.ПредварительнаяЗапись</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ТоварыНаСкладах</xr:Item>
				<xr:Item>AccumulationRegister.ЗаказыКлиентов</xr:Item>
				<xr:Item>AccumulationRegister.Продажи</xr:Item>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
				<xr:Item>AccumulationRegister.УчётЗатрат</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПредварительнаяЗапись</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Configuration/Documents/Реализация/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// СтандартныеПодсистемы.Печать

Процедура ПриОпределенииНастроекПечати(Настройки) Экспорт
    Настройки.ПриДобавленииКомандПечати = Истина;
КонецПроцедуры

Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
    КомандаПечати = КомандыПечати.Добавить();
    КомандаПечати.Идентификатор = "Реализация";
    КомандаПечати.Представление = НСтр("ru = 'Реализация'");
    КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
    КомандаПечати.Порядок = 10;
КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
    Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Реализация") Тогда
        УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
            КоллекцияПечатныхФорм,
            "Реализация",
            НСтр("ru = 'Реализация'"),
            СформироватьПечатнуюФормуРеализации(МассивОбъектов, ОбъектыПечати),
            ,
            "Документ.Реализация.ПФ_MXL_Реализация");
    КонецЕсли;
КонецПроцедуры

// СтандартныеПодсистемы.Печать

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СформироватьПечатнуюФормуРеализации(МассивОбъектов, ОбъектыПечати) Экспорт

    Запрос = Новый Запрос;
    Запрос.Текст =
    "ВЫБРАТЬ
    |    Реализация.Ссылка              КАК Ссылка,
    |    Реализация.Дата                КАК Дата,
    |    Реализация.Номер               КАК Номер,
    |    Реализация.Организация         КАК Организация,
    |    Реализация.Контрагент          КАК Контрагент,
    |    Реализация.Договор             КАК Договор,
    |    Реализация.Сотрудник           КАК Сотрудник,
    |    Реализация.Склад               КАК Склад,
    |    Реализация.ДокументОснование   КАК ДокументОснование,
    |    Реализация.СуммаДокумента      КАК СуммаДокумента,
    |    Реализация.Услуги.(
    |        НомерСтроки  КАК НомерСтроки,
    |        Услуга       КАК Услуга,
    |        Цена         КАК Цена,
    |        Количество   КАК Количество,
    |        Сумма        КАК Сумма
    |    ) КАК Услуги,
    |    Реализация.Товары.(
    |        НомерСтроки  КАК НомерСтроки,
    |        Номенклатура КАК Номенклатура,
    |        Цена         КАК Цена,
    |        Количество   КАК Количество,
    |        Сумма        КАК Сумма
    |    ) КАК Товары
    |ИЗ
    |    Документ.Реализация КАК Реализация
    |ГДЕ
    |    Реализация.Ссылка В (&СписокДокументов)";

    Запрос.УстановитьПараметр("СписокДокументов", МассивОбъектов);
    Выборка = Запрос.Выполнить().Выбрать();

    ТабличныйДокумент = Новый ТабличныйДокумент;
    ТабличныйДокумент.КлючПараметровПечати = "Реализация";

    Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.Реализация.ПФ_MXL_Реализация");

    ОбластьЗаголовок    = Макет.ПолучитьОбласть("Заголовок");
    Шапка               = Макет.ПолучитьОбласть("Шапка");
    ОбластьУслугиШапка  = Макет.ПолучитьОбласть("УслугиШапка");
    ОбластьУслуги       = Макет.ПолучитьОбласть("Услуги");
    ОбластьТоварыШапка  = Макет.ПолучитьОбласть("ТоварыШапка");
    ОбластьТовары       = Макет.ПолучитьОбласть("Товары");
    Подвал              = Макет.ПолучитьОбласть("Подвал");

    ВставлятьРазделительСтраниц = Ложь;

    Пока Выборка.Следующий() Цикл

        Если ВставлятьРазделительСтраниц Тогда
            ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		ОбластьЗаголовок.Параметры.ТекстЗаголовка = СтрШаблон(
			НСтр("ru = 'Реализация № %1 от %2'"),
			Выборка.Номер, Формат(Выборка.Дата, "ДЛФ=Д"));
		ТабличныйДокумент.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ДанныеОрганизации = ОрганизацииСервер.СведенияОбОрганизации(Выборка.Организация);
		Если ЗначениеЗаполнено(ДанныеОрганизации) Тогда
			Шапка.Параметры.Организация = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru='%1, ИНН %2'"),
				ДанныеОрганизации.Наименование,
				ДанныеОрганизации.ИНН);
			Подвал.Параметры.Руководитель     = ДанныеОрганизации.Руководитель;
			Подвал.Параметры.ГлавныйБухгалтер = ДанныеОрганизации.ГлавныйБухгалтер;
		КонецЕсли;
		ТабличныйДокумент.Вывести(Шапка);

        // ТЧ Услуги — выводить только если не пустая
        ВыборкаУслуги = Выборка.Услуги.Выбрать();
        Если ВыборкаУслуги.Количество() Тогда
            ТабличныйДокумент.Вывести(ОбластьУслугиШапка);
            Пока ВыборкаУслуги.Следующий() Цикл
                ОбластьУслуги.Параметры.Заполнить(ВыборкаУслуги);
                ТабличныйДокумент.Вывести(ОбластьУслуги, ВыборкаУслуги.Уровень());
            КонецЦикла;
        КонецЕсли;

        // ТЧ Товары — выводить только если не пустая
        ВыборкаТовары = Выборка.Товары.Выбрать();
        Если ВыборкаТовары.Количество() Тогда
            ТабличныйДокумент.Вывести(ОбластьТоварыШапка);
            Пока ВыборкаТовары.Следующий() Цикл
                ОбластьТовары.Параметры.Заполнить(ВыборкаТовары);
                ТабличныйДокумент.Вывести(ОбластьТовары, ВыборкаТовары.Уровень());
            КонецЦикла;
        КонецЕсли;

        Подвал.Параметры.Заполнить(Выборка);
        ТабличныйДокумент.Вывести(Подвал);

        УправлениеПечатью.ЗадатьОбластьПечатиДокумента(
            ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Выборка.Ссылка);

        ВставлятьРазделительСтраниц = Истина;

    КонецЦикла;

    Возврат ТабличныйДокумент;

КонецФункции

#КонецОбласти
